import { ObjectLiteralType } from '@gannochenko/ui.styled-components';

// Was not able to process the name: островского 1 2 3.jpg

const allBuildingsList = [
    [
        'Лукашова',
        [
            {
                range: '5',
                location: 'AAA',
            },
        ],
    ],
    // [
    //     'Борзова',
    //     [
    //         {
    //             range: '40-48',
    //             geometry: '54.736467, 20.475893',
    //         },
    //     ],
    // ],
    // [
    //     'Дзержинского',
    //     [
    //         {
    //             range: '139',
    //             geometry: '54.674283, 20.542881',
    //         },
    //     ],
    // ],
    // [
    //     'Краснохолмская',
    //     [
    //         {
    //             range: '8-10',
    //             geometry: '54.751601, 20.525265',
    //         },
    //     ],
    // ],
    // [
    //     'Орудийная',
    //     [
    //         {
    //             range: '27',
    //             geometry: '54.734596, 20.556894',
    //         },
    //     ],
    // ],
    // [
    //     'Рижская',
    //     [
    //         {
    //             range: '14',
    //             geometry: '54.717636, 20.524699',
    //         },
    //     ],
    // ],
    // [
    //     'Станочная',
    //     [
    //         {
    //             range: '2-4',
    //             geometry: '54.712825, 20.453345',
    //         },
    //     ],
    // ],
    // [
    //     'Тихорецкая',
    //     [
    //         {
    //             range: '3',
    //             geometry: '54.683835, 20.487679',
    //         },
    //     ],
    // ],
    // [
    //     'Хрисанфова',
    //     [
    //         {
    //             range: '5',
    //             geometry: '54.763805, 20.445108',
    //         },
    //     ],
    // ],
    // [
    //     'Чехова',
    //     [
    //         {
    //             range: '5',
    //             geometry: '54.738521, 20.524276',
    //         },
    //     ],
    // ],
    // [
    //     'Чехова',
    //     [
    //         {
    //             range: '12-14',
    //             geometry: '54.738832, 20.525292',
    //         },
    //     ],
    // ],
    // [
    //     'Чехова',
    //     [
    //         {
    //             range: '19',
    //             geometry: '54.740023, 20.526109',
    //         },
    //     ],
    // ],
    // [
    //     'Чехова',
    //     [
    //         {
    //             range: '27-29',
    //             geometry: '54.740917, 20.527169',
    //         },
    //     ],
    // ],
    // [
    //     'Чехова',
    //     [
    //         {
    //             range: '31-33',
    //             geometry: '54.741265, 20.527600',
    //         },
    //     ],
    // ],
    // [
    //     'Баженова',
    //     [
    //         {
    //             range: '48-50',
    //             geometry: '54.703685, 20.569987',
    //         },
    //     ],
    // ],
    // [
    //     'Белгородская',
    //     [
    //         {
    //             range: '32-38',
    //             geometry: '54.687983, 20.519399',
    //         },
    //     ],
    // ],
    // [
    //     'Гагарина',
    //     [
    //         {
    //             range: '141-145',
    //             geometry: '54.727120, 20.554604',
    //         },
    //         {
    //             range: '119-129',
    //             geometry: '54.726684, 20.553678',
    //         },
    //         {
    //             range: '147-151',
    //             geometry: '54.727406, 20.555331',
    //         },
    //         {
    //             range: '153-155',
    //             geometry: '54.727864, 20.556607',
    //         },
    //     ],
    // ],
    // [
    //     'Красная',
    //     [
    //         {
    //             range: '272-274',
    //             geometry: '54.747179, 20.473019',
    //         },
    //         {
    //             range: '276-278',
    //             geometry: '54.747574, 20.472668',
    //         },
    //         {
    //             range: '284-286',
    //             geometry: '54.748327, 20.472003',
    //         },
    //         {
    //             range: '280-282',
    //             geometry: '54.748104, 20.472201',
    //         },
    //     ],
    // ],
    // [
    //     'Летняя',
    //     [
    //         {
    //             range: '28',
    //             geometry: '54.674991, 20.486116',
    //         },
    //         {
    //             range: '26',
    //             geometry: '54.675215, 20.485990',
    //         },
    //         {
    //             range: '24-24а',
    //             geometry: '54.675439, 20.485864',
    //         },
    //         {
    //             range: '30-32',
    //             geometry: '54.674720, 20.486251',
    //         },
    //     ],
    // ],
    // [
    //     'Тамбовская',
    //     [
    //         {
    //             range: '13-15',
    //             geometry: '54.706568, 20.567836',
    //         },
    //         {
    //             range: '34-36',
    //             geometry: '54.705153, 20.566722',
    //         },
    //     ],
    // ],
    // [
    //     'Беговая',
    //     [
    //         {
    //             range: '70-80',
    //             geometry: '54.675574, 20.477565',

    //         },
    //     ],
    // ],
    // [
    //     'Брянская',
    //     [
    //         {
    //             range: '3-5',
    //             geometry: '54.749884, 20.535273',

    //         },
    //     ],
    // ],
    // [
    //     'Восточная',
    //     [
    //         {
    //             range: '3-5',
    //             geometry: '54.682160, 20.476775',

    //         },
    //     ],
    // ],
    // [
    //     'Галицкого',
    //     [
    //         {
    //             range: '50-52',
    //             geometry: '54.708093, 20.490741',

    //         },
    //     ],
    // ],
    // [
    //     'Гончарова',
    //     [
    //         {
    //             range: '13-15',
    //             geometry: '54.750313, 20.536550',

    //         },
    //     ],
    // ],
    // [
    //     'Дарвина',
    //     [
    //         {
    //             range: '2-4',
    //             geometry: '54.683454, 20.487493',

    //         },
    //     ],
    // ],
    // [
    //     'Карташева',
    //     [
    //         {
    //             range: '7',
    //             geometry: '54.716775, 20.370233',

    //         },
    //     ],
    // ],
    // [
    //     'Колхозная',
    //     [
    //         {
    //             range: '16',
    //             geometry: '54.746420, 20.526209',

    //         },
    //     ],
    // ],
    // [
    //     'переулок Литовский',
    //     [
    //         {
    //             range: '16-18',
    //             geometry: '54.709417, 20.536004',
    //             headerImage: 1,

    //         },
    //     ],
    // ],
    // [
    //     'Нансена',
    //     [
    //         {
    //             range: '1',
    //             geometry: '54.697089, 20.491326',

    //         },
    //     ],
    // ],
    // [
    //     'Островского',
    //     [
    //         {
    //             range: '1',
    //             geometry: '54.742663, 20.515168',
    //             headerImage: 1,

    //         },
    //         {
    //             range: '2',
    //             geometry: '54.742684, 20.515680',
    //             headerImage: 1,

    //         },
    //         {
    //             range: '3',
    //             geometry: '54.742689, 20.516245',

    //         },
    //     ],
    // ],
    // [
    //     'Парковая аллея',
    //     [
    //         {
    //             range: '4',
    //             geometry: '54.738697, 20.522363',

    //         },
    //     ],
    // ],
    // [
    //     'Проспект Победы',
    //     [
    //         {
    //             range: '180',
    //             geometry: '54.712768, 20.424231',
    //             headerImage: 2,

    //         },
    //         {
    //             range: '95-99',
    //             geometry: '',

    //         },
    //     ],
    // ],
    // [
    //     'Марины Расковой',
    //     [
    //         {
    //             range: '10',
    //             geometry: '54.718281, 20.471518',
    //             headerImage: 1,

    //         },
    //     ],
    // ],
    // [
    //     'Тихорецкая',
    //     [
    //         {
    //             range: '9',
    //             geometry: '54.683887, 20.486430',

    //         },
    //     ],
    // ],
    // [
    //     'Тульская',
    //     [
    //         {
    //             range: '23',
    //             geometry: '54.706797, 20.566129',

    //         },
    //     ],
    // ],
    // [
    //     'Урицкого',
    //     [
    //         {
    //             range: '7',
    //             geometry: '54.726829, 20.367592',
    //             headerImage: 2,

    //         },
    //     ],
    // ],
    // [
    //     'Челюскинская',
    //     [
    //         {
    //             range: '9',
    //             geometry: '54.727136, 20.363568',

    //         },
    //     ],
    // ],
];

const processedPhotosStreetMapObject: ObjectLiteralType<string> = {
    беговая: 'Беговая',
    баженова: 'Баженова',
    брянская: 'Брянская',
    белгородская: 'Белгородская',
    восточная: 'Восточная',
    галицкого: 'Галицкого',
    гончарова: 'Гончарова',
    гагарина: 'Гагарина',
    дарвина: 'Дарвина',
    карташева: 'Карташева',
    колхозная: 'Колхозная',
    'литовский п-к': 'переулок Литовский',
    нансена: 'Нансена',
    островского: 'Островского',
    'парковая аллея': 'Парковая аллея',
    'победы пр-кт': 'Проспект Победы',
    расковой: 'Марины Расковой',
    тихорецкая: 'Тихорецкая',
    тульская: 'Тульская',
    урицкого: 'Урицкого',
    челюскинская: 'Челюскинская',
    красная: 'Красная',
    летняя: 'Летняя',
    тамбовская: 'Тамбовская',
};

exports.processedPhotosStreetMap = processedPhotosStreetMapObject;
exports.allBuildings = allBuildingsList;
