import Enum from '../../../lib/base/enum/index.js';

export default new Enum([
    {key: 'A', value: 'Выявленные ОКН'},
    {key: 'B', value: 'Муниципальные ОКН'},
    {key: 'C', value: 'Региональные ОКН'},
    {key: 'D', value: 'Кирхи'},
    {key: 'E', value: 'Федеральные ОКН'},
    {key: 'F', value: 'Объекты, имеющие важное культурное значение или обладающие нераскрытым культурным потенциалом, а также объекты, обладающие архитектурно-пространственной, мемориальной и общественной ценностью'},
    {key: 'G', value: 'Объекты, обладающие признаками объекта культурного наследия'},
    {key: 'H', value: 'Утраченные объекты'},
    {key: 'I', value: 'Разное - временный слой для распределения ОКН'},
]);
